'-----------------------------------GiT---------------------------------------------------------'
#GIT - это система для отслеживония и ведения истории изменения файлов в нашем проекте, при помощи git можно оргонизовать командую работу 


'''
GIt-hub - это веб-сайт для размешения git-репозиториев в совместной разработке проектов.
Репозитерии - это хранилище нашего кода и истории его изменении
'''




# команды GIT:
'''
git init - создает локальный репозитории , в той директории в которой была прописана команда.
git add - это команда для добавления изменении в систему отслеживония гита (вместо точки можно указывать любую директорию) 
git commit -m "комментарии к коммиту"- это команда для сохронения всех  изменении с комментарием к ним 
git branch -M main - это команда создает главную ветку main
git remote add origin "url": это команда связывает наш локальный репозитории с удаленным репозиторием на Githube . 
git status - статус версии  
git push origin <main> - это команда отправки наших изменении на удаленный репозитории
git branch -  показывает на какой ветке мы находимся 
git chekout - это команда перемещается с одной ветки на другую
git pull origin <main> -  это команда стягиваем все изменении с нашего удаленного репозитерия на локальный
'''